{"projectInfo":{"name":"区块链赋能闭环供应链的动态运营策略和政府补贴机制研究","number":"72202113","leader":"马德青","duration":"2022.01 - 2025.12"},"projectIntro":"本研究聚焦区块链技术与闭环供应链的深度融合，针对传统闭环供应链存在的信息不透明、溯源难、协同效率低等痛点，结合区块链不可篡改、可追溯的核心特性，系统探究动态环境下供应链的生产、回收、再制造全流程运营策略。同时，构建适配区块链赋能场景的政府补贴机制，分析补贴方式、力度对供应链主体决策及环境、经济双重效益的影响。研究旨在为闭环供应链数字化转型提供理论支撑，为政府制定精准有效的产业扶持政策提供实践参考。","papers":[{"id":1,"title":"Can blockchain implementation combat food fraud: considering consumers' delayed quality perceptions","journal":"European Journal of Operational Research","authors":"马德青，吴雪萍，李开富，胡劲松*","time":"2025","abstract":"Food fraud is driven by unethical enterprises' economic incentives and endures due to consumers' delayed quality perceptions, while present solutions make it impossible for ethical firms to verify food quality in a timely and convincing manner. To that end, this paper focuses on a duopoly competition between an ethical firm (H) and an unethical firm (L) incorporating consumers' delayed quality perceptions. Considering the industry credibility crisis that food fraud may trigger, we analytically explore the conditions and effects of firm H to combat food fraud with the aid of blockchain technology (BCT). Counterintuitively, this paper finds that quality improvements beyond industry standards are not always beneficial to firms. Indeed, firms H and L will adopt quality improvements only when marginal returns are higher or delayed perceived time of quality (DPTQ) is longer, respectively. When deciding whether to adopt BCT, H should consider not only the implementation cost and DPTQ, but also the non-monotonic impact of DPTQ on the cost threshold. In addition, it is found that the application of BCT will always motivate H to make quality improvements and further enhance the goodwill, demand, and profits, but that the effect of combating food fraud is stage-specific. Within DPTQ, BCT will only serve as a marketing tool to enhance the competitiveness of H. It is outside of DPTQ that BCT can be effective in combating food fraud, not only by accelerating L's exit from the market, but also by increasing H's market share at the same time."},{"id":2,"title":"Internal reductions or carbon offset: How to achieve triple benefits in a consumer market with environmental concerns","journal":"International Journal of Production Economics","authors":"王雪，马德青*，胡劲松，刘贇","time":"2025","abstract":"Green and low-carbon production and operation methods have steadily emerged as one of the primary determinants of the enterprise's competitiveness in a consumer market concerned with environmental issues. This study examines a company that manufactures a single product and has the option of internal reductions only or purchasing carbon offsets along with internal reductions to reduce the product's carbon footprint. We developed a model to characterize the dynamic properties of the product's carbon footprint. The study finds that the consumer's level of environmental concern and the price of carbon offset are the main considerations for the firm's decision to develop carbon reduction methods. Interestingly, internal reductions and the purchasing carbon offset are not simple substitutions. When the price of carbon offset is extremely low, the firm purchases carbon offsets instead spur greater internal reductions. Another counterintuitive finding is that the firm with higher initial greenhouse gases from the product has relatively lower mitigation efforts. In addition, we obtain conditions under which the firm realizes economic, social, and environmental benefits from carbon footprint reduction methods. Finally, we extend our analysis to a scenario of duopoly competition and obtain similar conclusions."},{"id":1766238879852,"title":"Lenient or mandatory? Emission reduction coordination in supply chains considering consumers' environmental concerns","time":"2025","journal":"Journal of Cleaner Production","authors":"刘贇，马德青*，胡劲松，李振亚","abstract":"Supply chain climate action is imminent on a global scale. Supply chain carbon reduction is a key link for corporations to achieve the overall carbon Emission Reduction (CER) target. This study focuses on a low-carbon supply chain consisting of a manufacturer and a supplier and constructs a differential game model from the perspective of product carbon footprint changes. Against consumers' increasing environmental awareness, this paper analyzes the impact of the manufacturer-assisted supplier's carbon reduction approach on each party's profit, demand, environmental performance, and energy performance in a dynamic supply chain. The results show that the CER efforts of supply chain members increase with the degree of consumer environmental concern (CEC). When the cost-sharing ratio is within the threshold range, the manufacturer's coordination contract with the supplier becomes more stringent as CEC increases. Interestingly, when CEC is low, the supplier does not accept mandatory contracts even if the manufacturer is willing to share the higher CER cost. At the same time, the Pareto improvement conditions for a supply chain to achieve triple energy, environmental, and social performance are clarified."},{"id":1766238914636,"title":"Marketplace, wholesale or hybrid: considering the role of blockchain implementation in countering consumer mistrust","time":"2025","journal":"Electronic Commerce Research","authors":"马德青，邵文博，张凯月，胡劲松*","abstract":"Frequent exposure of fraud in online retailing has created consumer distrust in platforms and constrained the sustainability platform-based supply chains. We consider the role of blockchain in countering consumer mistrust and explore its impact on the platform sales modes selection (marketplace, wholesale, and hybrid) in a platform-based supply chain. Six game theoretic models where the platform takes three different sales modes (wholesale, marketplace, or hybrid) without and with blockchain adoption are developed. Intuition suggests that consumer mistrust reduces profits for the manufacturer and the platform. Counter-intuitively, there is little impact on the selection of platform sales modes. Moreover, as with previous studies where blockchain was not implemented, the manufacturer and the platform make an agreement on the wholesale (hybrid) mode when the commission rate and service effort are lower (higher) after implementing blockchain. The difference is that as the blockchain cost increases, the hybrid mode will no longer be selected."},{"id":1766240117572,"title":"多渠道零售下考虑消费者反展厅现象的平台型供应链销售模式选择","journal":"中国管理科学","time":"2024","authors":"马德青，王晓晴，胡劲松*","abstract":"在多渠道零售背景下，针对由一个制造商、一个平台型零售商和一个实体零售商构成的平台型供应链，探讨反展厅现象，即消费者在线上渠道获取产品信息后转向线下渠道完成购买的一种交叉渠道行为，对平台最优销售模式选择的影响。文章构建了四种微分博弈模型，分别是存在反展厅现象的转销模式（模型S），无反展厅现象的转销模式（模型NS），存在反展厅现象的代销模式（模型A）以及无反展厅现象的代销模式（模型NA），通过对比四种模式下的制造商质量改进水平、实体店的服务水平、平台型零售商的大数据营销服务水平以及品牌商誉和企业利润，解析分析了反展厅现象的影响。通过数值算例，验证了先前结论，并进一步探讨了平台最优销售模式成立的条件。研究结果表明：当不存在反展厅现象时，平台会在佣金率较低而线上零售价格较高的情况下选择转销模式，而在其他情况下选择代销模式。当反展厅现象存在时，平台还会在佣金率和线上零售价格都很高的时候选择转销，且这个区域会随反展厅现象强度加深而扩大。一个重要结果是，只有当反展厅现象存在时，供应链才有全局占优的销售模式。此外，研究表明，反展厅现象的存在不影响制造商和实体零售商的决策，但会抑制平台提供线上服务的积极性。反展厅现象的存在始终损害平台的利润水平，且随反展厅现象强度加深，平台受损更为严重。实体零售商会从反展厅现象中获利，且随反展厅现象强度加深，利润出现先增后减的情况，当反展厅现象强度中等时，其获利最多。对于制造商而言，反展厅现象强度变化对其的影响要结合平台佣金率和线上零售价格进行分析。"},{"id":1766238945820,"title":"How to leverage blockchain to react to consumer reference effects and develop a distribution strategy in online retailing?","time":"2024","journal":"Transportation Research Part E: Logistics and Transportation Review","authors":"马德青，李开富，胡劲松*，王雪","abstract":"False marketing on online platforms may distort consumer perceptions of product quality and exacerbate the negative impact of the reference quality effect (RQE). Blockchain technology (BCT) enables credible quality disclosure and is seen as a critical tool for brand manufacturers to combat false marketing. This article focuses on a platform-based supply chain comprising one brand manufacturer and one online retail platform. In this case, the brand manufacturer defines the product quality strategy and BCT implementation strategy, and the platform is responsible for online marketing and developing the distribution strategy. This paper clarifies when the manufacturer should implement BCT and how BCT affects the platform's distribution strategy when both RQE and reference price effect (RPE) are considered. The analytical results reveal four effects of BCT implementation: the decision motivation effect, marketing leverage effect, positive externality effect, and collaboration-enhancing effect. In addition, previous studies have suggested a negative impact of the RQE and RPE. We confirm that this occurs when online marketing is efficient and brand goodwill dominates demand. Counterintuitively, the two reference effects show positive impacts when online marketing is inefficient or the RPE dominates demand. The interaction between the two reference effects is further strengthened by BCT. Regarding the platform's distribution strategy, we confirm that the main results of previous studies occur when online marketing is efficient. Counterintuitively, when online marketing is inefficient, the platform will choose reselling at both lower and higher commission rates. Besides, agency selling is employed at moderate commission rates. Furthermore, it is demonstrated that BCT helps supply chain members reach stable and long-lasting cooperation on more product categories."},{"id":1766238991900,"title":"The triple optimal combination of selling format, service provision, and blockchain implementation in a platform-based supply chain","time":"2024","journal":"Computers & Industrial Engineering","authors":"马德青，李开富，吴雪萍，祝佳琪，胡劲松*","abstract":"In a platform-based supply chain, an online platform can act as a reseller (R) or a marketplace (A) for the manufacturer. Under each selling format, sales services can be provided by the manufacturer (M) or the platform (I). Besides, facing the problem of counterfeits and consumer mistrust, the platform can implement blockchain as a solution (B) or not (N). The combination of selling format selection strategy, service provision strategy, and blockchain implementation strategy produces 8 models: NMR, NMA, NIR, NIA, BMR, BMA, BIR, and BIA. On this basis, we explore the interaction of the three strategies and obtain a triple optimal combination (TOC). We find that blockchain implementation is always beneficial to the manufacturer and consumers, but blockchain will only be implemented by the platform and be beneficial to society when certain conditions are met. Under the reselling format, the manufacturer always prefers to authorize services to the platform; under the agency selling format, the manufacturer decides on the service provider according to commission rates. Based on the double optimal equilibrium, we further analyze the platform's selling format selection with the consideration of the manufacturer's preference and draw some interesting conclusions: When the commission rate is moderate in the lower commission rate range, the TOC is the BMA model; when both the commission rate and service efficiency are higher in the lower commission rate range or when the commission rate is lower in the higher commission rate range and service efficiency is high, the TOC is the BIR model."},{"id":1766239099700,"title":"Considering the cascade threat in the food supply chain for the retailer's ","time":"2024","journal":"Expert Systems with Applications","authors":"马德青，张凯月，邵文博，胡劲松*","abstract":"Food contamination causes a serious risk to public health and results in large financial losses when it occurs frequently. We consider the role of blockchain in food contamination and explore its implications for the strategic deployment of retailer contamination prevention effort. A supply chain with two suppliers and one retailer was proposed in this study. Supply chain participants may take out contamination prevention efforts to lessen the probability of food contamination. Among them, the retailer can trace the source of food contamination through the implementation of blockchain to reduce the loss of profits from the cascade threat. We developed a game-theoretic model to explore the strategic deployment of the retailer's contamination prevention effort with and without blockchain and the impact of implementing blockchain on strategic deployment and food safety. The intuition is that implementing blockchain always benefits supply chain members. However, counterintuitively, the retailer may not be able to realize greater profits. Interestingly, for contamination-vulnerable food (CVF), having blockchain increases suppliers and the retailer collaboration. Collaboration becomes less likely for contamination-resistant food (CRF). Finally, it is important to note that the implementation of blockchain, for CVF, will reduce the food contamination probability. But for CRF, it may not."},{"id":1766239260595,"title":"Impacts of blockchain technology on food supply chains with potential food contamination","time":"2024","journal":"Electronic Commerce Research and Applications","authors":"马德青，李开富，秦汉卿，胡劲松*","abstract":"Food contamination may have a catastrophic effect on companies, causing a plunge in goodwill. Motivated by the practice that existing voluntary recall strategies still suffer from untimeliness and imprecision, we consider blockchain to provide technical support for food traceability and recall by improving supply chain traceability and transparency. We focus on a two-tier food supply chain facing potential contamination occurrences and build a piecewise deterministic differential game model. We then obtain the optimal strategies of firms and evaluate the impact of contamination events on the dynamic operations of the supply chain. The results show increased contamination likelihood and damage rate, which harm the goodwill of food and optimal decision-making. In addition, we obtain the conditions for the company to be profitable when implementing the blockchain, which is closely related to contamination source identification time, recall efficiency, damage rate, and blockchain cost. Finally, we evaluate several specific cases."},{"id":1766239333500,"title":"Reseller or Market? E-platform strategy under blockchain-enabled recycling","time":"2024","journal":"Expert Systems with Applications","authors":"刘贇，马德青*，胡劲松","abstract":"Promoting the development of the e-platform and circular economy is significant. This study focuses on a closed-loop supply chain (CLSC) comprising an individual manufacturer and an individual e-platform. We construct a differential game model from the perspective of dynamic changes in product goodwill and study the issue of selection of sales mode for e-platforms when there exists an application of blockchain to solve the recycling problem. The results show that: The decision of an e-platform to build a blockchain in CLSC depends on the trade-off between blockchain implementation costs and effectiveness, which is determined by the product's real recovery rate. The decision to adopt blockchain does not affect the e-platform's selection of the sales mode, compared to the commission rate, which is the main influencing factor. Interestingly, in the region where the platform and the manufacturer agree, there is a counter-intuitive situation where the manufacturer and the e-platform agree on the reseller mode when the commission rate takes a value close to zero. Blockchain can not only enhance the performance of the CLSC backward chain by increasing the amount of reverse recycling but also improve the performance of the CLSC forward chain by increasing brand goodwill by raising the favorability of environmentally conscious consumers. Blockchain can enhance economic, environmental, and social performance (EES) across CLSC when the construction cost is within a certain threshold, achieving Pareto improvement in both reseller and market modes."},{"id":1766239389188,"title":"The selection of sales channels considering consumer behavior preferences in a co-branding strategy","time":"2023","journal":"Electronic Commerce Research and Applications","authors":"马德青，王晓晴，胡劲松*，李志彩","abstract":"As a marketing strategy, co-branding has become popular among brand manufacturers in recent years. Unlike previous studies on co-branding, we extend the research from manufacturer-to-manufacturer coopetition strategies to a platform-based supply chain. This paper builds two game theory models involving two manufacturers and one online platform, and divides consumers into Mavericks and Herds, who seek uniqueness and uniformity, respectively, and discusses the channel selection and the market positioning strategy. Some interesting findings are obtained, first, the equilibrium decisions are improved and the optimal profits are enhanced by considering the upstream and downstream cooperation. Second, the online retail channel is chosen when the revenue-sharing ratio is medium and the commission rate is low. Third, brand manufacturers have more opportunities to choose the online retail channel when the co-branded product is marketed to Herds, which is summarized as the market segmentation effect."},{"id":1766239527030,"title":"Understanding consumer reference price behavior in co-branding: from the perspective of a dynamic supply chain","time":"2023","journal":"Electronic Commerce Research","authors":"王晓晴，尹昊煜，马德青*","abstract":"Co-branding is an effective way for companies to expand their market and increase brand awareness. To study the conditions for a co-branding strategy, we develop a two-stage differential game model involving two manufacturers and an online platform to explore the choice of supply chain members, incorporating consumer reference price behavior. Interestingly, a result shows that manufacturers choose to co-brand if the combined impact factor is large and the revenue-sharing factor is medium, and the response of the platform for this choice is positive. Another finding is that although the impact of co-branding on operational decisions and consumers is uncertain, it is found that proper co-branding is a powerful tool for marketing strategies. In addition, the existence of reference price behavior improves operational decisions and influences the choice of a co-branding strategy. Furthermore, the extended model proves that big data marketing effectively expands the range of co-branding strategy selections."},{"id":1766239611299,"title":"The optimal combination between blockchain and sales format in an internet platform-based closed-loop supply chain","time":"2022","journal":"International Journal of Production Economics","authors":"马德青，胡劲松*","abstract":"Inspired by the practice of platform retailers cooperates with blockchain technology service providers to improve the recycling rate of waste products and solve the three bottleneck problems of recycling, this paper examines how the platform should optimize the combination of \"blockchain & sales format\" to improve the economic, social and environmental (ESS) performance of the closed-loop supply chain (CLSC). Through analytical models, three major effects of blockchain are revealed, namely brand premium effect, forward and backward attraction effect, and optimal combined effect. Besides, intuition suggests that the retail price decreases with increasing of consumer sensitivity to reference price effects, this result occurs in cases where reference price effects dominate demand. When the brand effect dominates demand, the counterintuitive result emerges that firms can raise the retail price with increased sensitivity. The implementation of blockchain will amplify the changes through brand premium effect in two corresponding cases. Another interesting finding is that only when the commission rate is extremely low/relatively high, the CLSC member can reach a stable cooperation relationship with the platform selling/agency selling. At the same time, the optimal \"blockchain & sales format\" of the platform that can achieve the triple benefits of EES in the CLSC is clarified. Furthermore, combined with the platform sales cases of different categories of products, this paper derives the \"blockchain & sales format\" combination strategy of platform enterprises for the universality of different attribute products."},{"id":1766239673443,"title":"Achieving triple sustainability in closed-loop supply chain: The optimal combination of online platform sales format and blockchain-enabled recycling","time":"2022","journal":"Computers & Industrial Engineering","authors":"马德青，秦汉卿，胡劲松*","abstract":"This paper examines the optimal combination of blockchain adoption in recycling used products and sales format selection of the online platform to achieve triple sustainability of economy, environment, and society. We focus on a closed-loop supply chain (CLSC) consisting of a manufacturer and an online platform. In the forward chain, the manufacturer sells products through the online platform who adopts reselling or agency selling sales format. In the backward chain, under extended producer responsibility, the manufacturer collects used products and can take advantage of the transparency, trust, and traceability features of blockchain technology, to increase the real recycling rate of used products and gain consumer trust. By constructing stylized differential game model, we clarify the condition of blockchain adoption and discuss the impact of blockchain on platform sales format selection and triple performance of the CLSC. The results show that the improvement in transparency and trust induced by blockchain will increase the brand goodwill and have positive effect on demand. Under blockchain-enabled recycling, the online platform and the manufacturer will reach a stable cooperation on platform reselling when the commission rate is extremely low, and agency selling when the commission rate is relatively high. However, the relationship of cooperation will break down when the commission rate is extremely high or relatively low. Furthermore, it is illustrated that the lower the real recycling rate, the better the effect of blockchain in enabling the triple sustainability of economy, environment, and society."},{"id":1766239723980,"title":"Considering consumer quality preferences, who should offer trade-in between manufacturer and retail platform?","time":"2025","journal":"Systems","authors":"马德青，胡迪，胡劲松*","abstract":"The trade-in service can enhance product sales and increase consumer loyalty; however, heterogeneity in consumer quality preferences significantly influences the provision and implementation of trade-in activities. By constructing a dynamic dual-supply chain model, this study examines the optimal choices for trade-in providers and the impact of consumer quality preferences on mode selection. The findings indicate that the decision of who should provide the trade-in service largely depends on the product’s quality decay rate. When the quality decay rate is low, collaboration between the manufacturer and the retail platform favors manufacturer-led trade-in service. Conversely, when the quality decay rate is high, both parties tend to fall into a prisoner’s dilemma, each preferring to dominate the trade-in process independently. Notably, as the share of pragmatic consumers increases, both sides of the supply chain are more inclined to prefer the manufacturer offering trade-in service. In our extended research, we found that the influence of government subsidies on mode selection primarily depends on the price discounts provided by the dominant party in trade-in arrangements within each mode. We also considered scenarios with asymmetric net residual values of recovered products, and the results robustly validate the stability of our core findings."},{"id":1766239798499,"title":"Loyalty or Indifference? Strategic Trade-in Design in Consumer-Segmented Markets","time":"2025","journal":"Sustainability","authors":"胡劲松，蒙乐芃，马德青*","abstract":"In the durable goods industry, trade-in programs have assumed a pivotal role, yet the fundamental principles governing firms' choices of trade-in models under market segmentation remain underexplored. This study introduces a loyalty-driven market segmentation framework, categorizing consumers into replacement groups (loyal consumers and indifferent consumers) and new consumers. By constructing an optimization model for a monopolistic firm, we analyze three trade-in models, trade-in for new, trade-in for cash, and hybrid trade-in, examining pricing, rebate, model selection strategies, and consumer surplus. The research reveals that the firm offers the most generous rebates under the trade-in for new model when the proportion of loyal consumers is extremely low. As this proportion increases, the hybrid trade-in model provides higher rebate intensity. When the proportion of loyal consumers is extremely high, the rebate intensity under the trade-in for cash model exceeds that of the other two models. The choice of trade-in model hinges on the threshold proportion of loyal consumers and replacement consumers: in high-loyalty markets, hybrid trade-in model achieves optimal performance. Conversely, in low-loyalty markets, trade-in for cash model prevails when the proportion of replacement consumers exceeds a specific threshold. Trade-in for new model becomes preferable when the proportion of replacement consumers is low. Hybrid trade-in model consistently maximizes the consumer surplus of indifferent consumers due to its flexibility, while loyal consumers benefit more from the trade-in for new model when their market share is dominant."},{"id":1766239918179,"title":"The impact of blockchain technology adoption on an e-commerce closed-loop supply chain considering consumer trust","time":"2024","journal":"Sustainability","authors":"马德青，马鹏程，胡劲松*","abstract":"This paper analytically explores the value of blockchain technology in building consumer trust in recyclers. We focus on an e-commerce closed-loop supply chain composed of an online platform and a manufacturer. In the forward chain, the platform selects a reselling or marketplace model to sell products. In the reverse chain, the platform collects used products, and the unknown whereabouts of the used products will cause consumer mistrust and be detrimental to the corporate image. Blockchain technology can address these challenges by improving the visibility of the recycling chain. By constructing differential game models, we specify the conditions for blockchain implementation and explore its impact on the online sales model choice and the E-CLSC performance. The findings show that the manufacturer consistently benefits from blockchain technology, while the platform decides to adopt it when the long-term profits outweigh the initial investment costs. Interestingly, the sales model selection will not change with the advent of blockchain technology. We further show the benefits of blockchain-enabled recycling and provide tangible insights for related practitioners."},{"id":1766239972094,"title":"Achieving triple benefits in a platform-based closed-loop supply chain: The optimal combination between recycling channel and blockchain","time":"2023","journal":"Sustainability","authors":"马德青，王晓晴，王雪，胡劲松*","abstract":"In order to solve the problem of false recycling, where the real recycling volume does not match the theoretical one, blockchain is widely used in practice due to its characteristics of transparency, traceability, and tamper resistance. To study its value in academics, this paper focuses on a closed-loop supply chain (CLSC) consisting of a manufacturer and an online platform. This paper discusses the implementation conditions of blockchain, the impact on enterprise decision making, and manufacturer recycling channel selection, and the triple benefits of economy, environment, and society in the CLSC with blockchain empowerment are achieved. Because of the nontransparency of the supply chain, the problem of false recycling is always present. To further solve the problem of false recycling, the recycler decides whether to implement blockchain or not. Through analysis and numerical examples, it is concluded that the greater the difference between real and theoretical recycling volumes, the greater the need for blockchain implementation. At the same time, three major effects of blockchain implementation are defined as decision incentive effect, marketing leverage effect, and incentive alignment effect, which reveal the impact of blockchain on increasing the motivation of CLSC members to make efforts, expanding the market size by improving brand goodwill, and avoiding the inconsistency between the manufacturer and the platform in the preference of the recycling channel. In addition, under blockchain empowerment, a cost range of blockchain implementation is defined, where both the manufacturer and the platform are better off, as well as the optimal recycling channel, which achieves the triple benefits of the CLSC."},{"id":1766240031131,"title":"Green agricultural products supply chain subsidy scheme with green traceability and data-driven marketing of the platform","time":"2023","journal":"International Journal of Environmental Research and Public Health","authors":"王雪，张家源，马德青*，孙浩","abstract":"Government subsidies have played an important role in the development of green agriculture. In addition, the Internet platform is becoming a new channel to realize green traceability and promote the sale of agricultural products. In this context, we consider a two-level green agricultural products supply chain (GAPSC) consisting of one supplier and one Internet platform. The supplier makes green R&D investments to produce green agricultural products along with conventional agricultural products, and the platform implements green traceability and data-driven marketing. The differential game models are established under four government subsidy scenarios: no subsidy (NS), consumer subsidy (CS), supplier subsidy (SS), and supplier subsidy with green traceability cost-sharing (TSS). Then, the optimal feedback strategies under each subsidy scenario are derived using Bellman's continuous dynamic programming theory. The comparative static analyses of key parameters are given, and the comparisons among different subsidy scenarios are conducted. Numerical examples are employed to obtain more management insights. The results show that the CS strategy is effective only if the competition intensity between two types of products is below a certain threshold. Compared to the NS scenario, the SS strategy can always improve the supplier's green R&D level, the greenness level, market demand for green agricultural products, and the system's utility. The TSS strategy can build on the SS strategy to further enhance the green traceability level of the platform and the greenness level and demand for green agricultural products due to the advantage of the cost-sharing mechanism. Accordingly, a win-win situation for both parties can be realized under the TSS strategy. However, the positive effect of the cost-sharing mechanism will be weakened as the supplier subsidy increases. Moreover, compared to three other scenarios, the increase in the environmental concern of the platform has a more significant negative impact on the TSS strategy."},{"id":1766240117571,"title":"Platform selling mode selection considering consumer reference effect in carbon emission reduction","time":"2022","journal":"International Journal of Environmental Research and Public Health","authors":"马德青，王雪，胡劲松*","abstract":"Considering the significant impact of the reference effect on consumer purchasing decisions and corporate profits, this paper mainly focuses on the influence of the reference effect of consumers in carbon emission reduction (CER) on the platform selling mode selection. To this end, this paper establishes a two-level supply chain consisting of a manufacturer who decides on CER in the production process and an online platform that conducts low-carbon publicity. Four differential game models in which the platform uses reselling mode or agency selling mode with or without consumer reference effect are established. The long-term stable cooperation relationship between the manufacturer and the platform, as well as the consumer surplus and social welfare under four models are further investigated. It is found that the reference effect on the platform selling mode is related to the low-carbon publicity effect and commission rate. When the reference effect exists, the intuition indicates that the platform will choose the reselling mode when the commission rate is relatively low. We clarify this result under the condition that the publicity effect is high. However, the manufacturer also prefers platform reselling, which is counterintuitive. When the commission rate is in the middle range, the platform chooses the agency selling mode, which is in line with the preference of the manufacturer. Surprisingly, when the platform’s publicity effect is low, the manufacturer and the platform reach stable cooperation in reselling mode when the commission rate is low or high, which is also counterintuitive. When the commission rate is in the middle range, they both prefer the agency selling mode. In addition, it is suggested that the triple benefits in economy, environment, and society are achieved as the optimal selling mode is confirmed in the presence of consumer reference effect in CER."}],"awards":[{"id":1766241179947,"name":"2025全国高被引学者TOP1%","year":"2025"},{"id":1766241179948,"name":"青岛大学2025春研究生优质课程","year":"2025"},{"id":1,"name":"山东省优秀研究生指导教师","year":"2025"},{"id":2,"name":"2024中国知网高被引学者TOP1%","year":"2024"},{"id":1766241140938,"name":"《中国管理科学》优秀审稿专家","year":"2024"},{"id":1766241150530,"name":"青岛市第三十七次社会科学优秀成果奖","year":"2023"},{"id":1766241161666,"name":"青岛大学优秀指导教师","year":"2023"},{"id":1766241175714,"name":"山东省优秀博士学位论文","year":"2022"},{"id":1766241179946,"name":"青岛市第三十六次社会科学优秀成果奖","year":"2022"}],"students":[{"id":1,"name":"王晓晴","achievements":"2021-2022学年青岛大学优秀学业二等奖学金（2022）\n2022-2023学年青岛大学优秀学业一等奖学金（2023）\n硕士研究生国家奖学金（2023）\n青岛大学优秀硕士学位论文（2024）\n山东省优秀硕士学位论文（2025）"},{"id":2,"name":"王雪","achievements":"2021-2022学年青岛大学优秀学业一等奖学金（2022）\n青岛大学优秀硕士学位论文（2023）\n2022-2023学年青岛大学博士研究生新生学业优秀奖学金（2023）\n2023-2024学年青岛大学博士研究生优秀学业二等奖学金（2024）"},{"id":1766240384468,"name":"秦汉卿","achievements":"2021-2022学年青岛大学优秀学业一等奖学金（2022）\n青岛大学优秀硕士学位论文（2024）"},{"id":1766240408827,"name":"马鹏程","achievements":"2021-2022学年青岛大学优秀学业二等奖学金（2022）"},{"id":1766240436114,"name":"张凯月","achievements":"2023-2024学年青岛大学研究生优秀学业一等奖学金（2024）\n青岛大学校长奖学金（2024）"},{"id":1766240479011,"name":"李开富","achievements":"2022-2023学年青岛大学优秀学业二等奖学金（2023）\n硕士研究生国家奖学金（2024）\n青岛大学优秀硕士学位论文（2025）\n2024-2025学年青岛大学研究生新生学业优秀奖学金（2025）"},{"id":1766240876898,"name":"邵文博","achievements":"2022-2023学年青岛大学优秀学业二等奖学金（2023）\n青岛大学优秀硕士学位论文（2025）"},{"id":1766240906898,"name":"王宇","achievements":"2023-2024学年青岛大学博士研究生新生学业优秀奖学金(2024)\n2024-2025学年青岛大学博士研究生优秀学业二等奖学金(2025)"},{"id":1766240927314,"name":"尹昊煜","achievements":"2023-2024学年青岛大学研究生优秀学业一等奖学金(2024)"},{"id":1766240938211,"name":"陆畅","achievements":"2022-2023学年青岛大学研究生新生学业二等奖学金(2023)\n2024-2025学年青岛大学优秀学业二等奖学金(2025)\n优秀学生(2025)"},{"id":1766240982274,"name":"蒙乐芃","achievements":"2023-2024学年青岛大学研究生优秀学业一等奖学金(2024)"},{"id":1766240995747,"name":"宁奥","achievements":"2022-2023学年青岛大学研究生新生学业二等奖学金(2023)"},{"id":1766241020499,"name":"杨淏轩","achievements":"2024-2025学年青岛大学研究生优秀学业一等奖学金"},{"id":1766241027890,"name":"章浩楠","achievements":"2024-2025学年青岛大学研究生优秀学业一等奖学金"},{"id":1766241042986,"name":"韩佳浩","achievements":"2024-2025学年青岛大学研究生优秀学业二等奖学金"}],"conferences":[{"id":1,"name":"第二十三届中国管理科学学术年会","location":"线上会议","status":"汇报"},{"id":2,"name":"INFORMS MSOM 2023","location":"加拿大魁北克省蒙特利尔市","status":"参会"},{"id":1766241270338,"name":"2023年度工商管理学科青年科学基金项目主持人学术交流会","location":"山东省青岛市","status":"汇报"},{"id":1766241298978,"name":"2023 INFORMS Annual Meeting","location":"美国亚利桑那州","status":"参会"},{"id":1766241339058,"name":"2023第三届可持续食品供应链创新论坛暨跨学科视域下的可持续运营与管理创新沙龙","location":"山东省济南市","status":"参会"},{"id":1766241361258,"name":"2023年度“数智服务管理”学术论坛暨第四届中国优选法统筹法与经济数学研究会服务科学与运作管理分会学术年会","location":"安徽省芜湖市","status":"参会"},{"id":1766241405410,"name":"2024第四届可持续食品供应链创新论坛暨数字经济背景下农产品供应链发展论坛","location":"陕西省咸阳市","status":"参会"},{"id":1766241428314,"name":"第七届中国可持续运营与管理学术会议","location":"内蒙古呼和浩特市","status":"参会"},{"id":1766241445794,"name":"INFORMS MSOM 2024","location":"美国苏明达州","status":"参会"},{"id":1766241460706,"name":"2024年POMS中国暑期学校","location":"辽宁省大连市","status":"参会"},{"id":1766241481354,"name":"中国优选法统筹法与经济数学研究会第十一次会员代表大会暨第二十六届中国管理科学学术年会","location":"上海市","status":"参会"},{"id":1766241493802,"name":"第五届全国供应链与运营管理学术年会","location":"湖北省武汉市","status":"参会"},{"id":1766241500082,"name":"ICIS 2024","location":"新西兰奥克兰","status":"参会"},{"id":1766241514828,"name":"INFORMS MSOM 2025","location":"英国伦敦","status":"参会"}]}